app/Repositories/ProvinceRepository.php

    public function getAllProvince()
    {
        return $this->provinceModel->orderBy('order', 'desc')->findAll();
---
SELECT *
FROM `vn_province`
ORDER BY `order` DESC