app/Repositories/UserRepository.php

    public function getUserById($id){
        return $this->userModel->where(['deleted_at' => 0])->find($id);
---
SELECT *
FROM `users`
WHERE `deleted_at` = 0
AND `users`.`id` = '12'

    public function updateUser($id, $data){
        return $this->userModel->update($id, $data);
---
UPDATE `users` SET `fullname` = 'Lê Việt Anh', `phone` = '0523591685', `birthday` = '', `gender` = '-1', `address` = 'Số 42 Cầu Đất', `cityid` = '01TTT', `districtid` = '0', `wardid` = NULL, `publish` = '1', `image` = '/upload/images/admin/z4194018533847_ecf7fdc2d6bdc99d133d30bde2de18c9.jpg', `updated_at` = '2023-04-11 22:03:54'
WHERE `users`.`id` IN ('12')